Transforming Data (Feature Engineering)
- apply( )
- map( )
- assign( )
- replace( old, new )

In [50]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("raw_data.csv")
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [12]:
df2 = df.copy()

df2["tax"] = df2["income"].apply(lambda x : "20%" if x>=60000 else "10%")

df2

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  10%
1    1      John Doe  29.0     USA     Male  55000.0  10%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  10%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  10%

Higher Order Functions are function which take another fucntion as parameter.

In [13]:
gender_map = {"Male": "M", "Female": "F", "Unknown": "U"}
df2["gender"] = df2["gender"].map(gender_map)

df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  10%
1    1      John Doe  29.0     USA      M  55000.0  10%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  10%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  10%

In [19]:
df2 = df2.assign(new_income = df2["income"] * 1.1)
df2

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0     USA      M  55000.0  10%     60500.0
1    1      John Doe  29.0     USA      M  55000.0  10%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN     USA      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  10%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0     USA      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  10%     63800.0

In [21]:
df2["country"] = df2["country"].replace("USA","US")
df2

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0      US      M  55000.0  10%     60500.0
1    1      John Doe  29.0      US      M  55000.0  10%     60500.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN      US      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0   China      M  51000.0  10%     56100.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0      US    NaN  58000.0  10%     63800.0

Transforming Data
- rename( columns={old: new} )
- sort_values( )
- sort_index( )
- reset_index( )
- rank( )
- Reorder columns

In [23]:
df2.rename(columns={"income":"salary"})
df2.rename(index={1:"first"})

       id          name   age country gender   income  tax  new_income
0       1      John Doe  29.0      US      M  55000.0  10%     60500.0
first   1      John Doe  29.0      US      M  55000.0  10%     60500.0
2       2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
3       3          Alex   NaN      US      U  47000.0  10%     51700.0
4       4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN
5       5        Li Wei  27.0   China      M  51000.0  10%     56100.0
6       6           NaN  45.0   India      F  73000.0  20%     80300.0
7       7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
8       8    Rachel Lee  29.0      US      F  62000.0  20%     68200.0
9       9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
10     10   Emily Davis  31.0      US    NaN  58000.0  10%     63800.0

In [30]:
df2.sort_values("income")
df2.sort_values("income", ascending=False)

sorted_df = df2.sort_values(["income","age"])

sorted_df.sort_index()

sorted_df

sorted_df.reset_index() # preserve index values
sorted_df.reset_index(drop=True)

    id          name   age country gender   income  tax  new_income
0    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0
1    3          Alex   NaN      US      U  47000.0  10%     51700.0
2    5        Li Wei  27.0   China      M  51000.0  10%     56100.0
3    1      John Doe  29.0      US      M  55000.0  10%     60500.0
4    1      John Doe  29.0      US      M  55000.0  10%     60500.0
5   10   Emily Davis  31.0      US    NaN  58000.0  10%     63800.0
6    8    Rachel Lee  29.0      US      F  62000.0  20%     68200.0
7    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0
8    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0
9    6           NaN  45.0   India      F  73000.0  20%     80300.0
10   4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN

In [34]:
sorted_df["ranking"] = sorted_df["income"].rank(ascending=False, method="dense")
sorted_df

    id          name   age country gender   income  tax  new_income  ranking
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%     49500.0      8.0
3    3          Alex   NaN      US      U  47000.0  10%     51700.0      7.0
5    5        Li Wei  27.0   China      M  51000.0  10%     56100.0      6.0
0    1      John Doe  29.0      US      M  55000.0  10%     60500.0      5.0
1    1      John Doe  29.0      US      M  55000.0  10%     60500.0      5.0
10  10   Emily Davis  31.0      US    NaN  58000.0  10%     63800.0      4.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%     68200.0      3.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%     68200.0      3.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%     74800.0      2.0
6    6           NaN  45.0   India      F  73000.0  20%     80300.0      1.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%         NaN      NaN

In [38]:
# reorder columns

sorted_df[['id', 'name', 'age', 'country', 'gender', 'income', 'tax', 'ranking', 'new_income']]

    id          name   age country gender   income  tax  ranking  new_income
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%      8.0     49500.0
3    3          Alex   NaN      US      U  47000.0  10%      7.0     51700.0
5    5        Li Wei  27.0   China      M  51000.0  10%      6.0     56100.0
0    1      John Doe  29.0      US      M  55000.0  10%      5.0     60500.0
1    1      John Doe  29.0      US      M  55000.0  10%      5.0     60500.0
10  10   Emily Davis  31.0      US    NaN  58000.0  10%      4.0     63800.0
8    8    Rachel Lee  29.0      US      F  62000.0  20%      3.0     68200.0
2    2    Jane Smith   NaN  Canada      F  62000.0  20%      3.0     68200.0
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%      2.0     74800.0
6    6           NaN  45.0   India      F  73000.0  20%      1.0     80300.0
4    4  Maria Garcia  34.0   Spain      F      NaN  10%      NaN         NaN

In [67]:
task = df.copy()

new_col = [x for x in task.columns if x != "id"] + ["id"]
 
task[new_col]

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10

In [56]:
import math

In [68]:
task = task.drop_duplicates()

task["age"] = task["age"].fillna(task["age"].mean())
task["age"] = task["age"].astype(int)

task

    id          name  age country   gender   income
0    1      John Doe   29     USA     Male  55000.0
2    2    Jane Smith   33  Canada   Female  62000.0
3    3          Alex   33     USA  Unknown  47000.0
4    4  Maria Garcia   34   Spain   Female      NaN
5    5        Li Wei   27   China     Male  51000.0
6    6           NaN   45   India   Female  73000.0
7    7    Ahmed Khan   38     NaN     Male  68000.0
8    8    Rachel Lee   29     USA   Female  62000.0
9    9   Carlos Ruiz   33  Mexico     Male  45000.0
10  10   Emily Davis   31     USA      NaN  58000.0

In [75]:
task[["name", "country", "gender"]] = task[["name", "country", "gender"]].ffill()
task

    id          name  age country   gender   income
0    1      John Doe   29     USA     Male  55000.0
2    2    Jane Smith   33  Canada   Female  62000.0
3    3          Alex   33     USA  Unknown  47000.0
4    4  Maria Garcia   34   Spain   Female  57889.0
5    5        Li Wei   27   China     Male  51000.0
6    6        Li Wei   45   India   Female  73000.0
7    7    Ahmed Khan   38   India     Male  68000.0
8    8    Rachel Lee   29     USA   Female  62000.0
9    9   Carlos Ruiz   33  Mexico     Male  45000.0
10  10   Emily Davis   31     USA     Male  58000.0

In [76]:
task["income"] = task["income"].fillna(task["income"].mean())
task["income"] = round(task["income"])

task

    id          name  age country   gender   income
0    1      John Doe   29     USA     Male  55000.0
2    2    Jane Smith   33  Canada   Female  62000.0
3    3          Alex   33     USA  Unknown  47000.0
4    4  Maria Garcia   34   Spain   Female  57889.0
5    5        Li Wei   27   China     Male  51000.0
6    6        Li Wei   45   India   Female  73000.0
7    7    Ahmed Khan   38   India     Male  68000.0
8    8    Rachel Lee   29     USA   Female  62000.0
9    9   Carlos Ruiz   33  Mexico     Male  45000.0
10  10   Emily Davis   31     USA     Male  58000.0

In [83]:
task.isna().sum()

task.to_csv("cleaned_data.csv")